Repository: giggleby/shim
Catalog: po/*.po
Languages: th_th

source: Upload Reg Codes
th_th: อัพโหลดรหัสการลงทะเบียน

source: Upload Serial Number for auditing
th_th: อัพโหลดหมายเลขซีเรียลเพื่อการตรวจสอบ

source: Upload Zero Touch Ids
th_th: อัพโหลด Zero Touch Ids

source: Update Toolkit
th_th: อัปเดตชุดเครื่องมือ

source: Running task: {label}
th_th: กําลังเรียกใช้งาน: {label}

source: Server Task Finished: {label}
th_th: งานเสร็จสิ้นบนเซิร์ฟเวอร์: {label}

source: Task <b>{label}</b> failed, retry in {time_left} seconds...
th_th: งาน <b>{label}</b> ล้มเหลว, ลองใหม่อีกครั้งใน {time_left} วินาที...

source: Flip the lid into tablet mode
th_th: พลิกฝาปิดเป็นโหมดแท็บเล็ต

source: Confirm tablet mode
th_th: ยืนยันโหมดแท็บเล็ต

source: Open the lid back to notebook mode
th_th: เปิดฝาปิดกลับมาเป็นโหมดโน้ตบุ๊ก

source: Press SPACE to confirm notebook mode
th_th: กดปุ่ม SPACE เพื่อยืนยันโหมดโน้ตบุ๊ก

source: Rotate the tablet to correctly align the picture, holding it at an upright 90-degree angle.
th_th: หมุนแท็บเล็ตให้รูปภาพเรียงตรงกัน โดยจับในมุม 90 องศาในแนวตั้ง

source: Please unplug and replug.
th_th: โปรดถอดและเสียบใหม่

source: Do not insert more than one loopback card.
th_th: อย่าใส่การ์ดลูปแบ็คมากกว่าหนึ่งใบ

source: The loopback card is inserted into the wrong port.
th_th: ใส่การ์ดลูปแบ็คเข้าพอร์ตผิด

source: Insert the loopback card.
th_th: ใส่การ์ดลูปแบ็ค

source: Remove the loopback card.
th_th: ถอดการ์ดลูปแบ็คออก

source: ERROR: Touch device not found
th_th: ข้อผิดพลาด: ไม่พบอุปกรณ์สัมผัส

source: Calibrating Touch device
th_th: กําลังปรับเทียบอุปกรณ์สัมผัส

source: Testing {item}...
th_th: กําลังทดสอบ {item}...

source: Please don't put your third finger on the touchpad. If you didn't do that, treat this touch panel as a problematic one!!
th_th: โปรดอย่าวางนิ้วที่สามของคุณลงบนทัชแพด ถ้าคุณไม่ได้ทําแบบนั้น โปรดถือว่าแผงสัมผัสนี้เป็นปัญหา!!

source: Ghost finger detected!! Please treat this touch panel as a problematic one!!
th_th: ตรวจพบนิ้วผี!! โปรดถือว่าแผงสัมผัสนี้เป็นปัญหา!!

source: Calibrating touchpad...
th_th: กําลังปรับเทียบทัชแพด...

source: Please put the hover-tool into the holder.
th_th: กรุณาใส่เครื่องมือโฮเวอร์ลงในที่ยึด

source: Please pull out the hover-tool from the holder.
th_th: โปรดดึงเครื่องมือลอยตัวออกจากที่เก็บ

source: Checking for false positive...
th_th: กำลังตรวจสอบหาผลบวกปลอม...

source: Please take off your fingers and then press SPACE to start testing...
th_th: กรุณาถอดนิ้วออกแล้วกด SPACE เพื่อเริ่มการทดสอบ...

source: Serial number
th_th: หมายเลขประจำเครื่อง

source: Submit
th_th: ยื่น

source: Probe goes down
th_th: โพรบเลื่อนลง

source: Probe goes up
th_th: โพรบเลื่อนขึ้น

source: Read sensor data
th_th: อ่านข้อมูลเซนเซอร์

source: Probe self test
th_th: ทดสอบโพรบด้วยตัวเอง

source: Controller status
th_th: สถานะตัวควบคุม

source: Refresh
th_th: เรียกข้อมูลใหม่

source: Touchscreen status
th_th: สถานะหน้าจอสัมผัส

source: Probe state
th_th: สถานะโพรบ

source: FixtureState
th_th: สถานะFixture

source: Shutdown the host
th_th: ปิดเครื่องโฮสต์

source: Please enter SN
th_th: โปรดป้อน SN

source: Fail to detect the touchscreen. Insert the traveler board, and restart the test.
th_th: ไม่สามารถตรวจพบหน้าจอสัมผัสได้ ใส่บอร์ดเดินทาง แล้วเริ่มการทดสอบใหม่

source: Fail to assign DIRECT_SENSORS_IP in ryu.conf
th_th: ไม่สามารถกําหนด DIRECT_SENSORS_IP ใน ryu.conf

source: Disconnected from controller
th_th: ตัดการเชื่อมต่อจากตัวควบคุมแล้ว

source: Probe not in initial position, aborted
th_th: โพรบไม่อยู่ในตําแหน่งเริ่มต้น ยกเลิกแล้ว

source: Please check if the USB cable has been connected between the test fixture and the control host. Click "RefreshFixture" button on screen after connecting the USB cable.
th_th: โปรดตรวจสอบว่าสายเคเบิล USB ได้เชื่อมต่อระหว่างอุปกรณ์ทดสอบและโฮสต์ควบคุมแล้วหรือยัง กรุณาคลิกปุ่ม "รีเฟรชฟิกซ์เจอร์" บนหน้าจอหลังจากเชื่อมต่อสาย USB

source: The test fixture is not ready. (1) It is possible that the test fixure is not powered on yet. Turn on the power and click "RefreshFixture" button on screen. (2) The test fixture is already powered on. The fixture may be in the emergency stop state. Press debug button on the test fixture and click "RefreshFixture" button on screen.
th_th: อุปกรณ์ทดสอบไม่พร้อม (1) อุปกรณ์ทดสอบอาจยังไม่ได้เปิดเครื่อง เปิดเครื่องแล้วกดปุ่ม "RefreshFixture" บนหน้าจอ (2) อุปกรณ์ทดสอบเปิดเครื่องแล้ว อุปกรณ์อาจอยู่ในสถานะหยุดฉุกเฉิน กดปุ่มดีบั๊กบนอุปกรณ์ทดสอบแล้วกดปุ่ม "RefreshFixture" บนหน้าจอ

source: Probe not in the DOWN position, aborted
th_th: โพรบไม่อยู่ในตําแหน่งล่างสุด ยกเลิก

source: Probe not in the UP position, aborted
th_th: โพรบไม่อยู่ในตําแหน่งบนสุด ยกเลิก

source: Wrong serial number!
th_th: หมายเลขซีเรียลผิด!

source: Fail to detect the touchscreen. Remove and re-insert the traveler board. And restart the test.
th_th: ตรวจจับหน้าจอสัมผัสไม่สําเร็จ ถอดและใส่บอร์ดที่เคลื่อนที่ได้ใหม่ แล้วเริ่มการทดสอบใหม่

source: Current calibration has not completed yet
th_th: การปรับเทียบปัจจุบันยังไม่เสร็จสิ้น

source: Please enter SN first
th_th: โปรดป้อน SN ก่อน

source: Please start drawing from upper-left corner.
th_th: โปรดเริ่มเขียนจากมุมบนซ้าย

source: Please leave your finger and restart from upper-left block.
th_th: โปรดนํานิ้วออกและเริ่มใหม่จากบล็อกมุมบนซ้าย

source: Fails to draw blocks in sequence. Please try again.
th_th: ไม่สามารถเขียนบล็อกตามลําดับได้ โปรดลองอีกครั้ง

source: Test failed! Please test this panel carefully with Gods Touch test.
th_th: การทดสอบล้มเหลว! โปรดทดสอบแผงนี้อย่างระมัดระวังด้วยการทดสอบ Gods Touch

source: Finger leaving too early. Please try again.
th_th: นิ้วเคลื่อนออกเร็วเกินไป โปรดลองอีกครั้ง

source: Draw blocks from upper-left corner in sequence; Esc to fail.
th_th: เขียนบล็อกจากมุมบนซ้ายในลําดับ; กด Esc เพื่อล้มเหลว

source: Draw blocks in any order; Esc to fail.
th_th: เขียนบล็อกในลําดับใดก็ได้; กด Esc เพื่อล้มเหลว

source: Updating base firmware. Do not remove the base.
th_th: กําลังอัปเดตเฟิร์มแวร์ฐาน อย่าถอดฐานออก

source: Verifying detachable base information...
th_th: กําลังตรวจสอบข้อมูลฐานถอดได้...

source: Please connect the detachable base.
th_th: โปรดเชื่อมต่อฐานถอดได้

source: Device Serial Number
th_th: หมายเลขซีเรียลอุปกรณ์

source: Mainboard Serial Number
th_th: หมายเลขซีเรียลเมนบอร์ดหลัก

source: VPD Region Code
th_th: รหัสภูมิภาค VPD

source: User Registration Code
th_th: รหัสลงทะเบียนผู้ใช้

source: Group Registration Code
th_th: รหัสลงทะเบียนกลุ่ม

source: No valid data on machine for {label}.
th_th: ไม่มีข้อมูลที่ถูกต้องบนเครื่องสําหรับ {label}

source: Invalid value for {label}.
th_th: ค่า {label} ไม่ถูกต้อง

source: Select {label}:
th_th: เลือก {label}:

source: Select with ENTER
th_th: เลือกด้วย ENTER

source: Enter {label}:
th_th: ใส่ {label}:

source: (ESC to keep current value)
th_th: (กด ESC เพื่อเก็บค่าปัจจุบัน)

source: Probing components...
th_th: กําลังสํารวจองค์ประกอบ...

source: Unable to pass verify component test.
th_th: ไม่สามารถผ่านการทดสอบการตรวจสอบองค์ประกอบได้

source: Number mismatch component classes
th_th: จํานวนองค์ประกอบไม่ตรงกัน

source: Not supported components
th_th: องค์ประกอบที่ไม่รองรับ

source: Component
th_th: องค์ประกอบ

source: Name
th_th: ชื่อ

source: Status
th_th: สถานะ

source: Loading parameters from local disk...
th_th: กําลังโหลดพารามิเตอร์จากดิสก์โหลดัล...

source: Setting up network...
th_th: กําลังตั้งค่าเครือข่าย...

source: Connecting with the ENA...
th_th: กําลังเชื่อมต่อกับ ENA...

source: Please fully disconnect all the cable.<br> Then press ENTER to continue.
th_th: โปรดถอดสายเคเบิลออกทั้งหมด <br> จากนั้นกด ENTER เพื่อดําเนินการต่อ

source: Checking its calibration status...
th_th: กําลังตรวจสอบสถานะการสอบเทียบ...

source: The ENA needs to be calibrated.<br> Please press ENTER to continue.
th_th: ENA ต้องการการสอบเทียบ โปรดกด ENTER เพื่อดําเนินการต่อ

source: Please place the LCD panel into the fixture and then press ENTER.
th_th: โปรดวางแผง LCD เข้าที่ในอุปกรณ์จับ แล้วกด ENTER

source: Make sure the main WWAN antennta is connected to Port 1<br> Make sure the main WLAN antennta is connected to Port 2<br> Then press key "A" to next stage.
th_th: โปรดตรวจสอบให้แน่ใจว่าเสาอากาศ WWAN หลักเชื่อมต่อกับพอร์ต 1<br>โปรดตรวจสอบให้แน่ใจว่าเสาอากาศ WLAN หลักเชื่อมต่อกับพอร์ต 2<br>จากนั้นกดปุ่ม "A" เพื่อไปขั้นตอนต่อไป

source: Testing...
th_th: กําลังทดสอบ...

source: Writing log....
th_th: กําลังเขียนบันทึก....

source: Results are listed below:
th_th: ผลลัพธ์มีดังต่อไปนี้:

source: Please disconnect the panel and press ENTER to write log.
th_th: โปรดถอดปลั๊กแผงและกด ENTER เพื่อเขียนบันทึก

source: Make sure the {name} antennta is connected to port {port}<br>
th_th: โปรดตรวจสอบให้แน่ใจว่าเสาอากาศ {name} เชื่อมต่อกับพอร์ต {port}<br>

source: Then press key "{key}" to next stage.
th_th: จากนั้นกดปุ่ม "{key}" เพื่อไปขั้นตอนต่อไป

source: Verifying VSync pin... ({count}/{total})
th_th: กําลังตรวจสอบพิน VSync... ({count}/{total})

source: Please run external test: {name}
th_th: โปรดเรียกใช้การทดสอบภายนอก: {name}

source: Power rail
th_th: เรลไฟฟ้า

source: voltage (mV)
th_th: แรงดันไฟฟ้า (mV)

source: expected
th_th: คาดหวัง

source: status
th_th: สถานะ

source: Please open the cover!
th_th: โปรดเปิดฝาครอบ!

source: Please close the cover!
th_th: โปรดปิดฝาครอบ!

source: Checking The Cover
th_th: กําลังตรวจสอบฝาครอบ

source: Running, please wait...
th_th: กําลังทํางาน, โปรดรอสักครู่...

source: Please wait for other DUTs to finish WiFiThroughput test, and press spacebar to continue.
th_th: โปรดรอให้ DUTs อื่นๆ ทดสอบ WiFiThroughput เสร็จสิ้นก่อน จากนั้นกดปุ่ม spacebar เพื่อดําเนินการต่อ

source: Scanning on device {device} frequency {freq}...
th_th: กําลังสแกนบนอุปกรณ์ {device} ความถี่ {freq}...

source: Done scanning on device {device} frequency {freq}...
th_th: เสร็จสิ้นการสแกนบนอุปกรณ์ {device} ความถี่ {freq}...

source: Detecting wifi chip type...
th_th: กําลังตรวจจับประเภทชิป wifi...

source: Checking frequencies...
th_th: กําลังตรวจสอบความถี่...

source: Press space to start scanning.
th_th: กดปุ่ม space เพื่อเริ่มการสแกน

source: Wireless Charge Port testing...
th_th: การทดสอบพอร์ตชาร์จไร้สาย...

source: {instruction} then hit SPACE
th_th: {instruction} จากนั้นกดปุ่ม SPACE

source: Writing device data to {vpd_section} VPD...
th_th: กําลังเขียนข้อมูลอุปกรณ์ไปยัง {vpd_section} VPD...

source: Full Reboot
th_th: รีบูตเต็มรูปแบบ

source: Halt
th_th: หยุด

source: Reboot
th_th: รีบูต

source: Has Cellular
th_th: มีเซลลูลาร์

source: Has LTE
th_th: มี LTE

source: Has Touchscreen
th_th: มีหน้าจอสัมผัส

source: Set DeviceInfo
th_th: ตั้งค่า DeviceInfo

source: Empty Test List
th_th: รายการทดสอบว่างเปล่า

source: Activate Registration Code
th_th: เปิดใช้รหัสการลงทะเบียน

source: Check Point for All Tests
th_th: จุดตรวจสอบสําหรับการทดสอบทั้งหมด

source: Audio Jack
th_th: ช่องเสียบเสียง

source: Audio Jack Conformance
th_th: ความสอดคล้องของช่องเสียบเสียง

source: Barrier
th_th: อุปสรรค

source: Base Accelerometers Calibration
th_th: การสอบเทียบเครื่องวัดแรงเฉื่อยฐาน

source: HDMI1 CEC Test
th_th: การทดสอบ HDMI1 CEC

source: HDMI2 CEC Test
th_th: การทดสอบ HDMI2 CEC

source: Back USB TypeC
th_th: USB TypeC ด้านหลัง

source: Type C HDMI CEC Test
th_th: การทดสอบ Type C HDMI CEC

source: Camera Tests
th_th: การทดสอบกล้อง

source: Charge Discharge Current
th_th: กระแสชาร์จ-ดีสชาร์จ

source: Charger Type Detection
th_th: การตรวจจับประเภทเครื่องชาร์จ

source: Check Cr50 Board ID Not Set
th_th: ตรวจสอบบอร์ด Cr50 ID ไม่ได้ตั้งค่า

source: Check Display Connection
th_th: ตรวจสอบการเชื่อมต่อจอแสดงผล

source: Check Fingerprint Firmware
th_th: ตรวจสอบเฟิร์มแวร์ลายนิ้วมือ

source: Check Point
th_th: จุดตรวจสอบ

source: Check Release Image
th_th: ตรวจสอบอิมเมจการเปิดตัว

source: Clear Cr50 AP RO Hash
th_th: ล้างแฮช Cr50 AP RO

source: Clear factory VPD entries
th_th: ล้างรายการ VPD ของโรงงาน

source: Clear Unknown RW VPD
th_th: ล้าง VPD RW ที่ไม่รู้จัก

source: EC Cold Reset
th_th: EC การรีเซ็ตเย็น

source: Cold Reset
th_th: การรีเซ็ตเย็น

source: Cr50 AP RO Verification
th_th: การยืนยัน RO AP Cr50

source: Cr50 AP RO Verification Group
th_th: กลุ่มตรวจสอบ RO AP Cr50

source: Deprovision CBI
th_th: ยกเลิกการจอง CBI

source: Disable Lid Switch
th_th: ปิดใช้งานสวิตช์ฝาปิด

source: Enable EC Write Protect
th_th: เปิดใช้งานการป้องกันการเขียน EC

source: Enable Lid Switch
th_th: เปิดใช้งานสวิตช์ฝาปิด

source: Ethernet Test
th_th: การทดสอบอีเทอร์เน็ต

source: Fingerprint Test Group
th_th: กลุ่มทดสอบลายนิ้วมือ

source: Fingerprint Sensor test
th_th: การทดสอบเซ็นเซอร์ลายนิ้วมือ

source: Finalize MLB
th_th: สิ้นสุด MLB

source: Finish
th_th: เสร็จสิ้น

source: Front Camera Assemble
th_th: ตรวจสอบการประกอบกล้องหน้า

source: Front Camera Assemble QR
th_th: ประกอบกล้องหน้า QR

source: Front Camera LED
th_th: ไฟ LED กล้องหน้า

source: Shopfloor Service (GetDeviceInfo)
th_th: บริการ Shopfloor (GetDeviceInfo)

source: Volume Down
th_th: ลดระดับเสียง

source: Volume Up
th_th: เพิ่มระดับเสียง

source: Power Button
th_th: ปุ่มเปิดปิด

source: Hardware Button
th_th: ปุ่มฮาร์ดแวร์

source: Idle
th_th: ไม่ได้ใช้งาน

source: Lid Accelerometers Calibration
th_th: การสอบเทียบมาตรวัดความเร่งฝาปิด

source: Create Cache
th_th: ตรวจสอบการอัปเดตแคช

source: Verify Cache No Update
th_th: ตรวจสอบแคชไม่มีการอัปเดต

source: Model and SKU
th_th: รุ่นและ SKU

source: Notebook Mode
th_th: โหมดโน้ตบุ๊ก

source: Notify Overlord to track connection
th_th: แจ้งให้ Overlord ติดตามการเชื่อมต่อ

source: Notify Overlord not to track connection
th_th: แจ้ง Overlord ไม่ให้ติดตามการเชื่อมต่อ

source: Placeholder
th_th: ตัวยึดตำแหน่ง

source: Probe Hardware
th_th: ฮาร์ดแวร์โพรบ

source: QR Scan
th_th: สแกน QR

source: Rear Camera Assemble
th_th: ประกอบกล้องหลัง

source: Rear Camera Assemble QR
th_th: กล้องหลังประกอบ QR

source: Rear Camera LED
th_th: ไฟ LED กล้องหลัง

source: Unload Driver
th_th: ยกเลิกการขับขี่

source: Recovery Button
th_th: ปุ่มกู้คืน

source: Load Driver
th_th: โหลดไดรเวอร์

source: Recovery Button Group
th_th: กลุ่มปุ่มกู้คืน

source: SD Performance
th_th: ประสิทธิภาพ SD

source: Screen Rotation
th_th: การหมุนหน้าจอ

source: Set Cr50 AP RO Hash
th_th: ตั้งแฮช RO AP Cr50

source: Set Widevine Keybox
th_th: ตั้งกล่องคีย์ Widevine

source: Reset Widevine keyboxes
th_th: รีเซ็ตกล่องคีย์ Widevine

source: Widevine Keybox provisioning Test Group
th_th: กลุ่มทดสอบการจัดเตรียมกล่องคีย์ Widevine

source: Shopfloor Service (NotifyEnd)
th_th: บริการบนชั้นการผลิต (แจ้งเตือนการสิ้นสุด)

source: Shopfloor Service (NotifyStart)
th_th: บริการบนชั้นการผลิต (แจ้งเตือนการเริ่มต้น)

source: Speaker/Microphone
th_th: ลำโพง/ไมโครโฟน

source: Speaker/Microphone Conformance
th_th: การปฏิบัติตามข้อกำหนดของลำโพง/ไมโครโฟน

source: Stress App Test
th_th: การทดสอบแอปความเครียด

source: Stylus And Garage
th_th: ปากกาและช่องเก็บปากกา

source: Verify TPM state
th_th: ตรวจสอบสถานะ TPM

source: Tablet Rotation Accelerometers
th_th: เครื่องวัดความเร่งการหมุนของแท็บเล็ต

source: Tablet Rotation Base-Accel
th_th: การหมุนของแท็บเล็ต Base-Accel

source: Tablet Rotation Lid-Accel
th_th: การหมุนของแท็บเล็ต Lid-Accel

source: Ti50 AP RO Verification (PVT)
th_th: การยืนยัน RO ของ Ti50 AP (PVT)

source: Ti50 AP RO Verification (pre-PVT)
th_th: การยืนยัน RO ของ Ti50 AP (pre-PVT)

source: Ti50 AP RO Verification
th_th: การยืนยัน RO ของ Ti50 AP

source: Touchscreen Uniformity
th_th: ความสม่ำเสมอของหน้าจอสัมผัส

source: Random Number Generation
th_th: การสร้างตัวเลขสุ่ม

source: USB Performance
th_th: ประสิทธิภาพ USB

source: USB2 TypeA Performance
th_th: ประสิทธิภาพ USB2 TypeA

source: USB3 TypeA Performance
th_th: ประสิทธิภาพ USB3 TypeA

source: Manual Test Left USB TypeA
th_th: ทดสอบแบบมือ USB TypeA ด้านซ้ายแบบแมนนวล

source: Manual Test Right USB TypeA
th_th: ทดสอบแบบมือ USB TypeA ด้านขวาแบบแมนนวล

source: USB3 CC1 Performance
th_th: ประสิทธิภาพ USB3 CC1

source: USB3 CC2 Performance
th_th: ประสิทธิภาพ USB3 CC2

source: USB2 Performance
th_th: ประสิทธิภาพ USB2

source: 20V Charging
th_th: ชาร์จ 20V

source: 5V Charging
th_th: ชาร์จ 5V

source: USB3 External Display Test
th_th: ทดสอบจอแสดงผลภายนอกผ่าน USB3

source: Left USB TypeC
th_th: USB TypeC ด้านซ้าย

source: Manual Test Left USB TypeC
th_th: ทดสอบแบบมือ USB TypeC ด้านซ้ายแบบแมนนวล

source: Right USB TypeC
th_th: USB TypeC ด้านขวา

source: Manual Test Right USB TypeC
th_th: ทดสอบแบบมือ USB TypeC ด้านขวาแบบแมนนวล

source: Update CBI
th_th: อัปเดต CBI

source: Check Cr50 Firmware Version
th_th: ตรวจสอบเวอร์ชันเฟิร์มแวร์ของ Cr50

source: Update Cr50 Firmware
th_th: อัปเดตเฟิร์มแวร์ของ Cr50

source: Update Fingerprint Firmware
th_th: อัปเดตเฟิร์มแวร์ลายนิ้วมือ

source: Update SKU ID
th_th: อัปเดตรหัส SKU

source: Update Ti50 Firmware
th_th: อัปเดตเฟิร์มแวร์ของ Ti50

source: Check Ti50 Firmware Version
th_th: ตรวจสอบเวอร์ชันเฟิร์มแวร์ของ Ti50

source: Clear Inactive Ti50 Slot
th_th: ล้างช่อง Ti50 ที่ไม่ได้ใช้งาน

source: Upload Reg (ECHO) Codes to activate
th_th: อัปโหลดรหัสลงทะเบียน (ECHO) เพื่อเปิดใช้งาน

source: Verify Widevine Keybox
th_th: ตรวจสอบกล่องคีย์ Widevine

source: Attach peripheral to charging port
th_th: ต่ออุปกรณ์ต่อพ่วงเข้ากับพอร์ตชาร์จ

source: Remove peripheral from charging port
th_th: ถอดอุปกรณ์ต่อพ่วงออกจากพอร์ตชาร์จ

source: Wireless Charger
th_th: แท่นชาร์จไร้สาย

source: Disconnect from wireless networks
th_th: ยกเลิกการเชื่อมต่อจากเครือข่ายไร้สาย

source: Write HWID
th_th: เขียน HWID

source: Write Test HWID
th_th: เขียน HWID สําหรับทดสอบ

source: FAT (Final Assembly Test)
th_th: FAT (การทดสอบการประกอบสุดท้าย)

source: Prepare
th_th: เตรียม

source: FFT (Final Functional Test)
th_th: FFT (การทดสอบหน้าที่การทํางานสุดท้าย)

source: GRT (Google Required Tests)
th_th: GRT (การทดสอบที่กําหนดโดย Google)

source: Generic Chromebook
th_th: ทั่วไป Chromebook

source: Generic RF Station
th_th: สถานี RF ทั่วไป

source: Generic RMA
th_th: RMA ทั่วไป

source: Dozing Stress
th_th: ความเครียดจากการงีบหลับ

source: Check WLAN
th_th: ตรวจสอบ WLAN

source: Check Bluetooth
th_th: ตรวจสอบบลูทูธ

source: Stress Group
th_th: กลุ่มทดสอบความเครียด

source: Warm Cold Reboot
th_th: รีบูตอุ่น-เย็น

source: Generic Rolling Reliability
th_th: ความน่าเชื่อถือในการทดสอบรันอินทั่วไป

source: Run-In Test
th_th: การทดสอบรันอิน

source: Stress Group With Front Camera
th_th: กลุ่มทดสอบความเครียดด้วยกล้องหน้า

source: Stress Group With Rear Camera
th_th: กลุ่มทดสอบความเครียดด้วยกล้องหลัง

source: Suspend Stress Memory Check
th_th: ระงับการตรวจสอบความเครียดของหน่วยความจำ

source: Webgl Aquarium 1000
th_th: เว็บจีแอล ตู้ปลา 1000

source: Webgl Aquarium 50
th_th: เว็บจีแอล ตู้ปลา 50

source: Check RMA test list
th_th: ตรวจสอบรายการทดสอบ RMA

source: SMT (SA Test)
th_th: SMT (SA ทดสอบ)

source: Parallel Test
th_th: การทดสอบความขนาน

source: MLB Serial Number
th_th: MLB เลขซีเรียล

source: Scan MLB
th_th: สแกน MLB

source: Operator ID
th_th: รหัสผู้ปฏิบัติงาน

source: Scan Operator ID
th_th: สแกนรหัสผู้ปฏิบัติงาน

source: Station ID
th_th: รหัสสถานี

source: ScanStationID
th_th: สแกนรหัสสถานี

source: Stress Test
th_th: การทดสอบความเครียด

source: Switch to RMA test list
th_th: สลับไปใช้รายการทดสอบ RMA

source: Test List for Tast Tests
th_th: รายการทดสอบสำหรับ Tast ทดสอบ

source: Provision Chromebook with SKU ID
th_th: เตรียมใช้งาน Chromebook ด้วยรหัส SKU

source: Check EOM NVAR
th_th: ตรวจสอบ EOM NVAR

source: Set EOM NVAR
th_th: ตั้งค่า NVAR สิ้นสุดการวัด

source: Start PSR Log
th_th: เริ่มบันทึกข้อมูล PSR

source: Execute Wipe Test-List
th_th: เรียกใช้รายการทดสอบเช็ดล้าง

source: Connect Device
th_th: เชื่อมต่ออุปกรณ์

source: Disconnect Device
th_th: ตัดการเชื่อมต่ออุปกรณ์

source: Copy Factory State From DUT
th_th: คัดลอกสถานะโรงงานจาก DUT

source: Copy Factory State To DUT
th_th: คัดลอกสถานะโรงงานไปยัง DUT

source: Merge Factory State On DUT
th_th: ผสานสถานะโรงงานลงใน DUT

source: Pop Factory State On Station
th_th: โหลดสถานะโรงงานเมื่อเข้าสถานี

source: Placeholder: AfterDisconnection
th_th: ตัวแทนที่: หลังตัดการเชื่อมต่อ

source: Placeholder: BeforeConnection
th_th: ตัวแทนที่: ก่อนการเชื่อมต่อ

source: Placeholder: Main
th_th: ตัวแทนที่: หลัก

source: Station-Based Test Template
th_th: แม่แบบการทดสอบแบบสถานี

source: Test Group
th_th: กลุ่มทดสอบ

source: Press Enter to pass.
th_th: กด Enter เพื่อผ่าน

source: Press ESC to fail.
th_th: กด ESC เพื่อยกเลิก
