Repository: giggleby/shim
Catalog: po/*.po
Languages: th_th

source: AC Power
th_th: ไฟ AC

source: Accelerometers
th_th: เครื่องวัดความเร่ง

source: Accelerometers Calibration
th_th: การสอบเทียบเครื่องวัดความเร่ง

source: Accelerometers Lid Angle
th_th: มุมฝาเครื่องวัดความเร่ง

source: Audio
th_th: เสียง

source: Audio Basic
th_th: เสียงพื้นฐาน

source: Audio Diagnostic
th_th: การวินิจฉัยเสียง

source: Audio Loop
th_th: เสียงวนซ้ำ

source: Audio Quality
th_th: คุณภาพเสียง

source: Backlight
th_th: ไฟแบ็คไลท์

source: Bad Blocks
th_th: บล็อกเสีย

source: Battery
th_th: แบตเตอรี่

source: Battery Basic
th_th: พื้นฐานแบตเตอรี่

source: Battery Current
th_th: กระแสไฟฟ้าของแบตเตอรี่

source: Battery Cycle
th_th: รอบการชาร์จแบตเตอรี่

source: Battery Sysfs
th_th: แบตเตอรี่ Sysfs

source: BFT Fixture
th_th: ชุดทดสอบ BFT

source: Blocking Charge
th_th: การชาร์จที่ถูกบล็อก

source: Bluetooth
th_th: บลูทูธ

source: Bluetooth Host
th_th: โฮสต์บลูทูธ

source: Branded Chassis
th_th: แชสซีที่มีตราสินค้า

source: Brightness
th_th: ความสว่าง

source: Brightness LCD Backlight
th_th: ความสว่างของแสงไฟแบ็คไลท์ LCD

source: Brightness LED
th_th: LED ความสว่าง

source: Button
th_th: ปุ่ม

source: Buzzer
th_th: กริ่ง

source: Camera
th_th: กล้องถ่ายรูป

source: Cellular Switch Firmware
th_th: เฟิร์มแวร์สวิตช์เซลลูลาร์

source: Charger
th_th: ที่ชาร์จ

source: Check CR50 Board ID
th_th: ตรวจสอบ ID บอร์ด CR50

source: Check Image Version
th_th: ตรวจสอบเวอร์ชันภาพ

source: Check Release LVM Stateful
th_th: ตรวจสอบ Release LVM Stateful

source: Check Retimer Firmware
th_th: ตรวจสอบเฟิร์มแวร์ Retimer

source: Check Secdata Version
th_th: ตรวจสอบเวอร์ชัน Secdata

source: Check Serial Number
th_th: ตรวจสอบหมายเลขซีเรียล

source: Check Test List
th_th: ตรวจสอบรายการทดสอบ

source: Clear Inactive GSC Slot
th_th: ล้างช่อง GSC ที่ไม่ใช้งาน

source: Compass
th_th: เข็มทิศ

source: Copy Minios
th_th: คัดลอก Minios

source: Countdown
th_th: การนับถอยหลัง

source: CR50 Ap Ro Verification
th_th: การยืนยัน CR50 Ap Ro

source: Display
th_th: จอแสดงผล

source: Display Images
th_th: แสดงภาพ

source: Display Interactive
th_th: แสดงแบบโต้ตอบ

source: Display Point
th_th: จุดแสดงผล

source: Download From Factory Drive
th_th: ดาวน์โหลดจาก Factory Drive

source: DSM Calibration
th_th: การสอบเทียบ DSM

source: Edp Panel Timing
th_th: การกำหนดเวลาแผง Edp

source: Ethernet
th_th: อีเธอร์เน็ต

source: Exec Python
th_th: รัน Python

source: Exec Shell
th_th: รัน Shell

source: External Display
th_th: จอแสดงผลภายนอก

source: Factory State
th_th: สถานะโรงงาน

source: Fan Speed
th_th: ความเร็วพัดลม

source: Feature Compliance Version
th_th: เวอร์ชันการปฏิบัติตามคุณลักษณะ

source: Finalize
th_th: เสร็จสิ้น

source: Fingerprint Mcu
th_th: ไมโครคอนโทรลเลอร์ลายนิ้วมือ

source: Flash Netboot
th_th: แฟลช Netboot

source: Gyroscope
th_th: ไจโรสโคป

source: Gyroscope Angle
th_th: มุมไจโรสโคป

source: Gyroscope Calibration
th_th: การสอบเทียบไจโรสโคป

source: Keyboard
th_th: คีย์บอร์ด

source: Keyboard Backlight
th_th: ไฟแบ็คไลท์คีย์บอร์ด

source: Keyboard SMT
th_th: คีย์บอร์ด SMT

source: Lid Switch
th_th: สวิตช์ฝาปิด

source: Light Sensor
th_th: เซ็นเซอร์วัดแสง

source: Light Sensor Calibration
th_th: การสอบเทียบเซ็นเซอร์วัดแสง

source: Lightbar
th_th: แถบไฟ

source: Line Check Item
th_th: การตรวจสอบโครงการ

source: Lock Intel Descriptor
th_th: ล็อค Intel Descriptor

source: LTE Verify Config
th_th: การยืนยันการกำหนดค่า LTE

source: Memory Size
th_th: ขนาดหน่วยความจำ

source: Message
th_th: ข้อความ

source: Model Sku
th_th: รุ่นสินค้า

source: Modem Security
th_th: ความปลอดภัยของโมเด็ม

source: Mouse
th_th: เมาส์

source: MRC Cache
th_th: แคช MRC

source: Network Setup
th_th: การตั้งค่าเครือข่าย

source: Partition Table
th_th: ตารางพาร์ติชัน

source: PD FW Min Version
th_th: เวอร์ชันเฟิร์มแวร์ PD ขั้นต่ำ

source: Ping Test
th_th: การทดสอบ Ping

source: Plankton CC2 Pull Test
th_th: การทดสอบการดึง Plankton CC2

source: Plankton CC Flip Check
th_th: การทดสอบพลิก Plankton CC

source: Plankton Charge
th_th: การชาร์จ Plankton

source: Plankton Display
th_th: จอแสดงผล Plankton

source: Privacy Screen
th_th: ฟิล์มกรองแสง

source: Probe
th_th: โพรบ

source: Probe Cellular Info
th_th: ตรวจสอบข้อมูลเซลลูลาร์

source: Probe Device Info
th_th: ตรวจสอบข้อมูลอุปกรณ์

source: Probe SIM
th_th: ตรวจสอบซิมการ์ด

source: Probe SIM Card Tray
th_th: ตรวจสอบถาดใส่ซิมการ์ด

source: Provision DRM Key
th_th: จัดเตรียมคีย์ DRM

source: Proximity Sensor
th_th: พร็อกซิมิตี้เซนเซอร์

source: Read Device Data From Cros Config
th_th: อ่านข้อมูลอุปกรณ์จาก Cros Config

source: Read Device Data From VPD
th_th: อ่านข้อมูลอุปกรณ์จาก VPD

source: Removable Storage
th_th: อุปกรณ์จัดเก็บข้อมูลแบบถอดได้

source: Retrieve Config
th_th: ดึงข้อมูลการกำหนดค่า

source: RF Graphyte
th_th: กราไฟต์ RF

source: Robot Movement
th_th: การเคลื่อนไหวของหุ่นยนต์

source: Sample Customized Test
th_th: แบบทดสอบที่กำหนดเองตัวอย่าง

source: Scan
th_th: สแกน

source: Select For Sampling
th_th: เลือกสำหรับการสุ่มตัวอย่าง

source: Serial Echo
th_th: อนุกรม Echo

source: Setup PSR Feature
th_th: ตั้งค่าคุณลักษณะ PSR

source: Shopfloor Service
th_th: บริการบนพื้นโรงงาน

source: Shutdown
th_th: ปิดเครื่อง

source: Spatial Sensor Calibration
th_th: การสอบเทียบเซ็นเซอร์เชิงพื้นที่

source: Start
th_th: เริ่ม

source: Station Entry
th_th: การเข้าสถานี

source: Station Setup
th_th: การตั้งค่าสถานี

source: Storage Simple Stress
th_th: ความเครียดในการเก็บข้อมูลอย่างง่าย

source: Stressapptest
th_th: การทดสอบความเครียดของแอป

source: Stylus
th_th: สไตลัส

source: Stylus Garage
th_th: โรงเก็บสไตลัส

source: Summary
th_th: บทสรุป

source: Suspend Resume
th_th: ระงับประวัติการทำงาน

source: Suspend Stress
th_th: ระงับความเครียด

source: Switch Test List
th_th: รายการทดสอบสวิตช์

source: Sync Factory Server
th_th: เซิร์ฟเวอร์โรงงานซิงค์

source: Sync Time
th_th: ซิงค์เวลา

source: Tablet Mode
th_th: โหมดแท็บเล็ต

source: Tablet Rotation
th_th: การหมุนแท็บเล็ต

source: Thermal Load
th_th: ภาระความร้อน

source: Thermal Sensors
th_th: เซ็นเซอร์ความร้อน

source: Thermal Slope
th_th: ความลาดชันความร้อน

source: Thunderbolt Loopback
th_th: ลูปแบ็ค Thunderbolt

source: TI50 Ap Ro Verification
th_th: การยืนยัน TI50 Ap Ro

source: Touch Device FW Update
th_th: การอัปเดตเฟิร์มแวร์อุปกรณ์สัมผัส

source: Touch Uniformity
th_th: ความสม่ำเสมอของการสัมผัส

source: Touchpad
th_th: ทัชแพด

source: Touchpad Hover
th_th: การเลื่อนเมาส์บนทัชแพด

source: Touchscreen
th_th: หน้าจอสัมผัส

source: Touchscreen Calibration
th_th: การสอบเทียบหน้าจอสัมผัส

source: TPM Clear Owner
th_th: ล้างข้อมูลเจ้าของ TPM

source: TPM Diagnosis
th_th: การวินิจฉัย TPM

source: TPM State
th_th: สถานะ TPM

source: TPM Verify EK
th_th: ตรวจสอบ EK TPM

source: Update Cbi
th_th: อัปเดต CBI

source: Update CR50 Firmware
th_th: อัปเดตเฟิร์มแวร์ CR50

source: Update Detachable Base
th_th: อัปเดตฐานแยก

source: Update Device Data
th_th: อัปเดตข้อมูลอุปกรณ์

source: Update Firmware
th_th: อัปเดตเฟิร์มแวร์

source: Update Fpmcu Firmware
th_th: อัปเดตเฟิร์มแวร์ Fpmcu

source: Update Kernel
th_th: อัปเดตเคอร์เนล

source: Update Plugin Firmware
th_th: อัปเดตเฟิร์มแวร์ปลั๊กอิน

source: Update PSR Oem Data
th_th: อัปเดตข้อมูล OEM PSR

source: Urandom
th_th: ยูรันดอม

source: Verify Component
th_th: ตรวจสอบส่วนประกอบ

source: Verify Keybox
th_th: ตรวจสอบกล่องคีย์

source: Verify Root Partition
th_th: ตรวจสอบพาร์ติชันรูท

source: Video Playback
th_th: การเล่นวิดีโอ

source: Wait External Test
th_th: รอการทดสอบภายนอก

source: Wait Fixture Ready
th_th: รออุปกรณ์พร้อม

source: Webgl Aquarium
th_th: ตู้ปลา WebGL

source: Whale Check Voltage
th_th: Whale ตรวจสอบแรงดันไฟฟ้า

source: Whale Cover
th_th: Whale ฝาครอบ

source: Wifi Check Calibration
th_th: การสอบเทียบการตรวจสอบ Wifi

source: Wifi Throughput
th_th: ปริมาณข้อมูลผ่าน Wifi

source: Wireless Antenna
th_th: เสาอากาศไร้สาย

source: Wireless Charge
th_th: การชาร์จแบบไร้สาย

source: Wireless Connect
th_th: การเชื่อมต่อไร้สาย

source: Write Device Data To VPD
th_th: เขียนข้อมูลอุปกรณ์ไปยัง VPD

source: Write Protect Switch
th_th: สวิตช์ป้องกันการเขียน

source: State:
th_th: สถานะ:

source: Description:
th_th: คำอธิบาย:

source: Input:
th_th: อินพุต:

source: Time remaining:
th_th: เวลาที่เหลือ:

source: Factory tests stopped
th_th: การทดสอบของโรงงานหยุด

source: {label} ({iterations} times)
th_th: ({label}) ({iterations} ครั้ง)

source: An error occurred while starting the factory test system Factory testing cannot proceed.
th_th: เกิดข้อผิดพลาดขณะเริ่มต้นระบบทดสอบโรงงาน การทดสอบของโรงงานไม่สามารถดำเนินการต่อได้

source: Set iterations and retries of test "{test}"
th_th: ตั้งค่ารอบและการลองใหม่ของการทดสอบ "{test}"

source: Iterations must be a positive integer or -1.
th_th: จำนวนรอบต้องเป็นจำนวนเต็มบวกหรือ -1

source: Retries must be a positive integer, 0, or -1.
th_th: จำนวนการลองใหม่ต้องเป็นจำนวนเต็มบวก 0 หรือ -1

source: Iterations or retries is too large. Please use -1 to represent infinity.
th_th: จำนวนรอบหรือการลองใหม่มากเกินไป กรุณาใช้ -1 แทนอินฟินิตี้

source: Press OK to shutdown
th_th: กด OK เพื่อปิดเครื่อง

source: Rebooting
th_th: การรีบูต

source: Shutting down
th_th: การปิดเครื่อง

source: once
th_th: ครั้งหนึ่ง

source: {count} of {total} times
th_th: {count} ครั้งจาก {total} ครั้ง

source: {action} in {seconds_left} seconds ({times_text}). To cancel, press the Escape key.
th_th: {action} ใน {seconds_left} วินาที ({times_text}) เพื่อยกเลิก กดปุ่ม Esc

source: Shutting down...
th_th: กำลังปิดเครื่อง...

source: Cancel
th_th: ยกเลิก

source: Critical factory note; cannot run tests
th_th: บันทึกโรงงานที่สำคัญ; ไม่สามารถรันการทดสอบได้

source: Not in engineering mode; cannot skip tests
th_th: ไม่ได้อยู่ในโหมดวิศวกรรม; ไม่สามารถข้ามการทดสอบได้

source: Run all {count} tests in "{test}"
th_th: รันการทดสอบทั้งหมด {count} รายการใน "{test}"

source: Run test "{test}"
th_th: รันการทดสอบ "{test}"

source: Restart all {count} tests in "{test}"
th_th: รีสตาร์ทการทดสอบทั้งหมด {count} รายการใน "{test}"

source: Restart test "{test}"
th_th: รีสตาร์ทการทดสอบ "{test}"

source: Restart {count} tests in "{test}" that have not passed
th_th: รีสตาร์ทการทดสอบ {count} รายการใน "{test}" ที่ยังไม่ผ่าน

source: Clear status of {count} tests in "{test}"
th_th: ล้างสถานะการทดสอบ {count} รายการใน "{test}"

source: Clear status of test "{test}"
th_th: ล้างสถานะการทดสอบ "{test}"

source: All the running tests will be stopped for clearing status.
th_th: การทดสอบทั้งหมดที่กำลังทำงานจะถูกหยุดเพื่อล้างสถานะ

source: Run {count} untested tests in "{test}"
th_th: รันการทดสอบ {count} รายการที่ยังไม่ได้ทดสอบใน "{test}"

source: Set {count} tests in "{test}" to run multiple times
th_th: ตั้งค่าการทดสอบ {count} รายการใน "{test}" ให้รันหลายครั้ง

source: Set test "{test}" to run multiple times
th_th: ตั้งค่าการทดสอบ "{test}" ให้รันหลายครั้ง

source: Stop all tests
th_th: หยุดการทดสอบทั้งหมด

source: Abort {count} active tests in "{test}" and continue testing
th_th: ยกเลิก {count} การทดสอบที่กําลังดําเนินอยู่ใน "{test}" แล้วดําเนินการทดสอบต่อ

source: Abort active test "{test}" and continue testing
th_th: ยกเลิกการทดสอบ "{test}" ที่กําลังดําเนินอยู่ แล้วดําเนินการทดสอบต่อ

source: Show test UI
th_th: แสดง UI ทดสอบ

source: System time:
th_th: เวลาระบบ:

source: Your Name
th_th: ชื่อของคุณ

source: Note Content
th_th: เนื้อหาบันทึก

source: Severity
th_th: ความรุนแรง

source: Add Note
th_th: เพิ่มบันทึก

source: Uploading factory logs...
th_th: กําลังอัพโหลดบันทึกโรงงาน...

source: Uploading factory logs. Please wait...
th_th: กําลังอัพโหลดบันทึกโรงงาน โปรดรอสักครู่...

source: Serial Number
th_th: เลขที่อนุกรม

source: Bug Description
th_th: คําอธิบายข้อบกพร่อง

source: Upload Factory Logs
th_th: อัพโหลดบันทึกโรงงาน

source: Save Factory Logs to USB
th_th: บันทึกบันทึกโรงงานไปยัง USB

source: Saving factory logs to USB drive...
th_th: กําลังบันทึกบันทึกโรงงานไปยังไดรฟ์ USB...

source: Success! Saved factory logs ({size}) bytes) to {dev} as {filename}. The drive has been unmounted.
th_th: สําเร็จ! บันทึกบันทึกโรงงาน ({size} ไบต์) ไปยัง {dev} ชื่อไฟล์ {filename} ไดรฟ์ถูกถอดออกแล้ว

source: Success! Saved factory logs ({size}) bytes) to {dev} as {filename}.
th_th: สําเร็จ! บันทึกบันทึกโรงงาน ({size} ไบต์) ไปยัง {dev} ชื่อไฟล์ {filename}

source: Enter an optional identifier for the archive (or press Enter for none):
th_th: ป้อนตัวบ่งชี้ที่เป็นตัวเลือกสําหรับเก็บข้อมูล (หรือกด Enter เพื่อไม่ระบุ):

source: Include probe result (takes longer time)
th_th: รวมผลการทดสอบโปรบ (ใช้เวลานานขึ้น)

source: Please insert a formatted USB stick and wait a moment for it to be mounted.
th_th: โปรดใส่ USB ที่ฟอร์แมตแล้ว และรอสักครู่ให้มันเชื่อมต่อ

source: Update factory software
th_th: อัปเดตซอฟต์แวร์โรงงาน

source: Save note on device
th_th: บันทึกบันทึกไว้บนอุปกรณ์

source: View notes
th_th: ดูบันทึก

source: Clear notes
th_th: ลบบันทึก

source: Diagnosis Tool
th_th: เครื่องมือวินิจฉัย

source: Save factory logs to USB drive...
th_th: กําลังบันทึกบันทึกโรงงานไปยังไดรฟ์ USB...

source: Upload factory logs...
th_th: กําลังอัพโหลดบันทึกโรงงาน...

source: DUT Shutdown
th_th: ปิดเครื่อง DUT

source: Reload Test List
th_th: โหลดรายการทดสอบใหม่

source: Toggle engineering mode
th_th: สลับโหมดวิศวกรรม

source: Switch test list
th_th: สลับรายการทดสอบ

source: Switch Test List: {test_list}
th_th: สลับรายการทดสอบ: {test_list}

source: Warning: Switching to test list "{test_list}" will clear all test state. Are you sure you want to proceed?
th_th: คําเตือน: การสลับไปยังรายการทดสอบ "{test_list}" จะล้างสถานะการทดสอบทั้งหมด คุณแน่ใจหรือไม่ว่าต้องการดําเนินการต่อ?

source: Yes, clear state and restart
th_th: ใช่, ล้างสถานะและเริ่มใหม่

source: Switching test list. Please wait...
th_th: กําลังสลับรายการทดสอบ โปรดรอสักครู่...

source: Software update
th_th: อัปเดตซอฟต์แวร์

source: Updating factory software. Please wait...
th_th: กําลังอัปเดตซอฟต์แวร์โรงงาน โปรดรอสักครู่...

source: Update succeeded. Restarting.
th_th: อัปเดตสําเร็จ เริ่มใหม่อีกครั้ง

source: No update is currently necessary.
th_th: ไม่จําเป็นต้องอัปเดตในขณะนี้

source: Update failed:
th_th: อัปเดตล้มเหลว:

source: currentLocaleName#en-US#English
th_th: currentLocaleName#th-TH#ภาษาไทย

source: Device manager
th_th: ตัวจัดการอุปกรณ์

source: Update Station Properties
th_th: อัปเดตคุณสมบัติสถานี

source: Station Name
th_th: ชื่อสถานี

source: Manufacture Line Number
th_th: หมายเลขไลน์การผลิต

source: Station Number
th_th: หมายเลขสถานี

source: {key} can't be empty!
th_th: {key} ไม่สามารถเป็นค่าว่างได้!

source: Station with same {keys!r} found.
th_th: พบสถานีที่มี {keys!r} ซ้ํากัน

source: Stage
th_th: ขั้นตอน

source: IP Address
th_th: ที่อยู่ IP

source: Test Image
th_th: ภาพทดสอบ

source: Release Image
th_th: ปล่อยภาพ

source: Main Firmware
th_th: เฟิร์มแวร์หลัก

source: Kernel
th_th: เคอร์เนล

source: Architecture
th_th: สถาปัตยกรรม

source: Root Device
th_th: อุปกรณ์รูท

source: Device ID
th_th: อุปกรณ์ ID

source: Factory Toolkit Version
th_th: เวอร์ชันชุดเครื่องมือโรงงาน

source: (no update)
th_th: (ไม่มีการอัปเดต)

source: HWID Database Version
th_th: เวอร์ชันฐานข้อมูล HWID

source: Unknown
th_th: ไม่ทราบ

source: System time
th_th: เวลาระบบ

source: Test Path
th_th: เส้นทางทดสอบ

source: Test Label
th_th: ป้ายทดสอบ

source: Invocation ID
th_th: การเรียกใช้ ID

source: Elapsed Time
th_th: เวลาที่ผ่านไป

source: Test Name
th_th: ชื่อการทดสอบ

source: Test Arguments
th_th: อาร์กิวเมนต์การทดสอบ

source: Show Original
th_th: แสดงต้นฉบับ

source: Engineering mode
th_th: โหมดวิศวกรรม

source: {seconds} seconds
th_th: {seconds} วินาที

source: Elapsed time:
th_th: เวลาที่ผ่านไป:

source: Time remaining:
th_th: เวลาที่เหลือ:

source: Test Progress:
th_th: ความคืบหน้าการทดสอบ:

source: Screenshot (Press Ctrl+S)
th_th: ภาพหน้าจอ (กด Ctrl+S)

source: Mark Failed
th_th: ทําเครื่องหมายว่าล้มเหลว

source: Pull the lever down.
th_th: ดึงคันโยกลง

source: Pull the lever up.
th_th: ดึงคันโยกขึ้น

source: Unplug the charger.
th_th: ถอดปลั๊กที่ชาร์จออก

source: Plug in the charger ({type})
th_th: เสียบสายชาร์จ ({type})

source: Plug in the charger
th_th: เสียบสายชาร์จ

source: Detected power {watt} W, required power range ({min_watt} W, {max_watt} W)
th_th: ตรวจพบกําลังไฟ {watt} W, ช่วงกําลังไฟที่ต้องการ ({min_watt} W, {max_watt} W)

source: Probed {times} / {total}
th_th: ตรวจสอบแล้ว {times} / {total}

source: No AC adapter
th_th: ไม่มีอะแดปเตอร์ AC

source: Identifying AC adapter...
th_th: การระบุอะแดปเตอร์ AC...

source: AC adapter type: {type}
th_th: ประเภทอะแดปเตอร์ AC: {type}

source: Press SPACE to continue
th_th: กด SPACE เพื่อดําเนินการต่อ

source: Test will be started within {secs} seconds. Please do not move the device.
th_th: การทดสอบจะเริ่มใน {secs} วินาที โปรดอย่าขยับอุปกรณ์

source: Test is in progress, please do not move the device.
th_th: การทดสอบกำลังดำเนินการอยู่ โปรดอย่าขยับอุปกรณ์

source: Please put device on a horizontal plane then press space to start calibration.
th_th: กรุณาวางอุปกรณ์บนระนาบราบเรียบ แล้วกดปุ่ม space เพื่อเริ่มการสอบเทียบ

source: Please put device on a horizontal plane.
th_th: กรุณาวางอุปกรณ์บนระนาบราบเรียบ

source: Calibration will be started within {time} seconds.Please do not move device.
th_th: การสอบเทียบจะเริ่มขึ้นภายใน {time} วินาที กรุณาอย่าเคลื่อนย้ายอุปกรณ์

source: Calibration is in progress, please do not move device.
th_th: กําลังสอบเทียบอยู่ กรุณาอย่าเคลื่อนย้ายอุปกรณ์

source: Please open the lid to {angle} degrees.
th_th: กรุณาเปิดฝาปิดให้เป็นมุม {angle} องศา

source: Checking angle...
th_th: กําลังตรวจสอบมุม...

source: Please open the lid to {angle} degrees and press SPACE.
th_th: กรุณาเปิดฝาปิดให้เป็นมุม {angle} องศา แล้วกดปุ่ม SPACE

source: Left Channel
th_th: ช่องซ้าย

source: Right Channel
th_th: ช่องขวา

source: Please wait for the {device} playback to finish.
th_th: กรุณารอให้การเล่นของ {device} เสร็จสิ้น

source: Press the number you hear from {device} to pass the test.<br>Press "R" to replay.
th_th: กดตัวเลขที่คุณได้ยินจาก {device} เพื่อผ่านการทดสอบ<br>กด "R" เพื่อเล่นซ้ํา

source: Internal Speaker
th_th: ลําโพงภายใน

source: Please plug headphone in.
th_th: กรุณาเสียบหูฟังเข้าไป

source: Please unplug headphone.
th_th: กรุณาถอดหูฟังออก

source: Headset
th_th: หูฟัง

source: Start recording
th_th: เริ่มบันทึก

source: Playback sound (Mic channel {channel})
th_th: เล่นเสียงที่บันทึกไว้ (ไมโครโฟนช่อง {channel})

source: Playback sound to channel {channel}
th_th: เล่นเสียงที่บันทึกไว้ที่ช่อง {channel}

source: Press 'P' to first play a sample for each channel to ensure audio output works.<br>Press 'R' to record {record_sec} seconds, Playback will follow.<br>Press space to mark pass.
th_th: กด 'P' เพื่อเล่นตัวอย่างแต่ละช่องเสียงเพื่อตรวจสอบว่าเอาต์พุตเสียงทํางานหรือไม่<br>กด 'R' เพื่อบันทึก {record_sec} วินาที เสียงที่บันทึกจะเล่นต่อจากนั้น<br>กดปุ่ม space เพื่อทําเครื่องหมายผ่าน

source: Tone generator
th_th: เครื่องกําเนิดเสียง

source: Tone off
th_th: ปิดเสียง

source: Tone On
th_th: เปิดเสียง

source: Manual record
th_th: บันทึกด้วยตนเอง

source: Stop record
th_th: หยุดบันทึก

source: Start record
th_th: เริ่มบันทึก

source: Stop playback
th_th: หยุดเล่น

source: Start playback
th_th: เริ่มเล่น

source: Audio loopback
th_th: การตอบกลับเสียง

source: Loopback off
th_th: ปิดการตอบกลับเสียง

source: Loopback on
th_th: เปิดการตอบกลับเสียง

source: Output Nodes
th_th: โหนดเอาต์พุต

source: Input Nodes
th_th: โหนดอินพุต

source: Plug in audio jack dongle
th_th: เสียบดองเกิลแจ็คเสียงเข้า

source: Hit s to start loopback test
th_th: กด s เพื่อเริ่มทดสอบการตอบกลับเสียง

source: Loopback testing... Success Rate: {successRate}
th_th: กําลังทดสอบการตอบกลับเสียง... อัตราความสําเร็จ: {successRate}

source: Loopback testing...
th_th: กําลังทดสอบการตอบกลับเสียง...

source: Testing Result: Fail Success Rate: {successRate}
th_th: ผลการทดสอบ: ไม่ผ่าน อัตราความสําเร็จ: {successRate}

source: Testing Result: Success!
th_th: ผลการทดสอบ: ผ่าน!

source: Running Conformance test.... Input dev: {input_device}
th_th: กําลังเรียกใช้การทดสอบมาตรฐาน.... อินพุต dev: {input_device}

source: Running Conformance test.... Output dev: {output_device}
th_th: กําลังเรียกใช้การทดสอบมาตรฐาน.... Âwt phut dev: {output_device}

source: Press 'Space' to start test
th_th: กด 'Space' เพื่อเริ่มการทดสอบ

source: Connected
th_th: เชื่อมต่อแล้ว

source: Waiting for command
th_th: รอคําสั่ง

source: Audio looping
th_th: การวนซ้ําเสียง

source: Speaker on
th_th: เปิดลําโพง

source: LCD Dmic on
th_th: เปิดไมโครโฟนติด LCD

source: MLB Dmic on
th_th: เปิดไมโครโฟนติด MLB

source: Playing tone to left channel
th_th: กําลังเล่นเสียงโทนไปยังช่องขวา

source: Playing tone to right channel
th_th: กําลังเล่นเสียงโทนไปยังช่องขวา

source: Waiting for IP address
th_th: กําลังรอที่อยู่ IP

source: Ready for connection
th_th: พร้อมเชื่อมต่อแล้ว

source: Press Space to change backlight brightness;<br>Press Esc to reset backlight brightness to original;<br>After checking, Enter H if pressing Space changes the backlight to be brighter;<br>Enter L if pressing Space changes the backlight to be dimmer.<br>This test will be executed twice.
th_th: กด Space เพื่อเปลี่ยนความสว่างของไฟหลังจอ;<br>กด Esc เพื่อรีเซ็ตความสว่างของไฟหลังจอให้กลับสู่ค่าเดิม;<br>หลังจากทดสอบแล้ว ให้พิมพ์ H ถ้าการกด Space ทําให้ไฟหลังจอสว่างขึ้น;<br>พิมพ์ L ถ้าการกด Space ทําให้ไฟหลังจอมืดลง<br>การทดสอบนี้จะทําซ้ํา 2 ครั้ง

source: Testing {test_size_mb} region of storage
th_th: กําลังทดสอบพื้นที่จัดเก็บข้อมูล {test_size_mb}

source: Phase {current_phase}/{total_phases}:
th_th: เฟส {current_phase}/{total_phases}:

source: Plug AC to proceed
th_th: เสียบสายไฟ AC เพื่อดําเนินการต่อ

source: Testing battery charge...
th_th: กําลังทดสอบการชาร์จแบตเตอรี่...

source: Unplug AC to proceed
th_th: ถอดปลั๊กไฟ AC เพื่อดําเนินการต่อ

source: Testing battery discharge...
th_th: กําลังทดสอบการคายประจุแบตเตอรี่...

source: Waiting for {target_status} current to meet {target_current} mA. (Currently {status} at {current} mA)
th_th: กําลังรอให้กระแส {target_status} มีค่าเท่ากับ {target_current} mA(ในขณะนี้ {status} อยู่ที่ {current} mA)

source: charging
th_th: กําลังชาร์จ

source: discharging
th_th: กําลังคายประจุ

source: Insert power to {prompt}({voltage}mV)
th_th: ใส่สายไฟเพื่อ {prompt} ({voltage}mV)

source: Average current in charging mode is {charging_current}<br>Average current in discharging mode is {discharging_current}<br>Target current difference is {target}, but present current difference is {present_difference}
th_th: กระแสเฉลี่ยในโหมดชาร์จคือ {charging_current}<br>กระแสเฉลี่ยในโหมดคายประจุคือ {discharging_current}<br>ความแตกต่างของกระแสเป้าหมายคือ {target} แต่ความแตกต่างของกระแสในปัจจุบันคือ{present_difference}

source: Calculating the current difference between charging mode and discharging mode.
th_th: กําลังคํานวณหาความแตกต่างของกระแสระหว่างโหมดชาร์จและโหมดคายประจุ

source: CheckCurrentDifference failed. This is the {times} try
th_th: เช็คความแตกต่างของกระแสล้มเหลว นี่เป็นครั้งที่ {times} ในการลอง

source: Charging to {target}% (Start: {start}%. Current: {current}%.)<br>Time elapsed: {elapsed} Time remaining: {remaining}
th_th: กําลังชาร์จไปที่ {target}% (เริ่มต้น: {start}%. ปัจจุบัน: {current}%)<br>เวลาที่ผ่านไป: {elapsed} เวลาที่เหลืออยู่: {remaining}

source: Enable the connection ability of bluetooth device and press Enter
th_th: เปิดใช้งานความสามารถในการเชื่อมต่อบลูทูธ แล้วกด Enter

source: Place the base into the fixture, and press the space key on the test host.
th_th: นําเบสใส่ลงในอุปกรณ์ยึด แล้วกดปุ่ม space บนเครื่องทดสอบ

source: Please re-attach the magnet, and press the space key on the test host.
th_th: กรุณาติดแม็กเน็ตใหม่ แล้วกดปุ่ม space บนเครื่องทดสอบ

source: Turn on charging by pressing the green button, take the keyboard out and put it back, and press the space key on the test host.
th_th: เปิดชาร์จโดยกดปุ่มสีเขียว นําแป้นพิมพ์ออกแล้วใส่กลับเข้าไป แล้วกดปุ่ม space บนเครื่องทดสอบ

source: Press the green button again to stop charging, and press the space key on the test host.
th_th: กดปุ่มสีเขียวอีกครั้งเพื่อหยุดชาร์จ แล้วกดปุ่ม space บนเครื่องทดสอบ
