Repository: giggleby/shim
Catalog: po/*.po
Languages: th_th

source: Read firmware revision string.
th_th: อ่านข้อมูลเวอร์ชันเฟิร์มแวร์

source: Check if the battery has charged to a higher percentage
th_th: ตรวจสอบว่าแบตเตอรี่ชาร์จไปถึงเปอร์เซ็นต์ที่สูงขึ้นหรือไม่

source: Read battery level for the 1st time.
th_th: อ่านระดับแบตเตอรี่ครั้งแรก

source: Read battery level for the 2nd time.
th_th: อ่านระดับแบตเตอรี่ครั้งที่ 2

source: Detect bluetooth adapter
th_th: ตรวจหาแฮนด์เซ็ตบลูทูธ

source: Unpairing
th_th: กําลังยกเลิกการจับคู่

source: Scanning...
th_th: กําลังสแกน...

source: Press shift-p-a-i-r simultaneously on the base.
th_th: กด shift-p-a-i-r พร้อมกันบนเบส

source: Detect RSSI (count {count}/{total})
th_th: กําลังตรวจจับ RSSI (นับแล้ว {count}/{total})

source: Enter passkey {key} then press enter on the base.
th_th: กรุณาใส่รหัส {key} แล้วกดเอนเตอร์บนเบส

source: Authentication failed, retrying...
th_th: การพิสูจน์ตัวตนล้มเหลว กําลังลองใหม่อีกครั้ง...

source: Pairing to input device now...
th_th: กําลังจับคู่กับอุปกรณ์ป้อนข้อมูลเดี๋ยวนี้...

source: Connecting to input device now...
th_th: กําลังเชื่อมต่อกับอุปกรณ์ป้อนข้อมูลเดี๋ยวนี้...

source: Please test input. Press Escape to fail and Enter to pass
th_th: กรุณาทดสอบการป้อนข้อมูล กด Escape เพื่อล้มเหลว และกด Enter เพื่อผ่าน

source: Verify branded chassis
th_th: ตรวจสอบโครงสร้างแบรนด์

source: Please verify if the chassis has X label on it.If Yes, press "Y". If not, press "N"
th_th: กรุณาตรวจสอบว่าโครงสร้างมีป้าย X หรือไม่ ถ้ามี ให้กด "Y" ถ้าไม่มี ให้กด "N"

source: The DUT is a branded chassis
th_th: อุปกรณ์ที่ทดสอบเป็นโครงสร้างแบรนด์

source: The DUT is NOT branded chassis
th_th: อุปกรณ์ที่ทดสอบไม่ใช่โครงสร้างแบรนด์

source: Data is inconsistent, please double check!
th_th: ข้อมูลไม่สอดคล้องกัน กรุณาตรวจสอบอีกครั้ง!

source: Please check if backlight brightness is changing from dark to bright.
th_th: กรุณาตรวจสอบว่าแสงสว่างของจอภาพเปลี่ยนจากมืดไปเป็นสว่างหรือไม่

source: Press the {name} button
th_th: กดปุ่ม {name}

source: Press the {name} button ({count}/{total})
th_th: กดปุ่ม {name} ({count}/{total})

source: Release the button
th_th: ปล่อยปุ่ม

source: How many beeps do you hear? <br>Press space to start.
th_th: คุณได้ยินเสียงบี๊ปกี่ครั้ง? <br>กด space เพื่อเริ่ม

source: How many beeps do you hear? <br>Press the number you hear to pass the test.<br>Press 'r' to play again.
th_th: คุณได้ยินเสียงบี๊ปกี่ครั้ง? <br>กดตัวเลขที่คุณได้ยินเพื่อผ่านการทดสอบ<br>กด 'r' เพื่อเล่นอีกครั้ง

source: Press ENTER to pass or ESC to fail.
th_th: กด ENTER เพื่อผ่าน หรือ ESC เพื่อล้มเหลว

source: Running the camera until timeout.
th_th: กําลังเปิดกล้องจนกว่าจะหมดเวลา

source: Running the camera until expected number of frames captured.
th_th: กําลังเปิดกล้องจนกว่าจะบันทึกเฟรมครบตามที่กําหนด

source: Cover the field of view of the camera with a white paper. The red grids represent which region is too dark.
th_th: ปิดบังมุมมองของกล้องด้วยกระดาษสีขาว ตารางตาข่ายสีแดงแสดงพื้นที่มืดเกินไป

source: Scanning QR code...
th_th: กําลังสแกน QR โค้ด...

source: Place QR code in the frame and cover the field of view of the camera with a white paper. The red grids represent which region is too dark.
th_th: นํา QR โค้ดมาวางไว้ในกรอบ แล้วปิดบังมุมมองของกล้องด้วยกระดาษสีขาวตารางตาข่ายสีแดงแสดงพื้นที่มืดเกินไป

source: Detecting faces...
th_th: กําลังตรวจจับใบหน้า...

source: Checking brightness...
th_th: กําลังตรวจสอบความสว่าง...

source: Press 0 if LED is constantly lit, 1 if LED is flickering, or ESC to fail.
th_th: ถ้า LED ติดสว่างตลอด ให้กด 0, ถ้า LED กะพริบ ให้กด 1, หรือกด ESC เพื่อล้มเหลว

source: Scanned QR code: "{text}"
th_th: สแกน QR โค้ดได้: "{text}"

source: Success!
th_th: สําเร็จ!

source: Failure
th_th: ล้มเหลว

source: Camera assemble: {camera_well_assembled}, QR code: {qr_code_scan_success}
th_th: การประกอบกล้อง: {camera_well_assembled}, QR โค้ด: {qr_code_scan_success}

source: Muted frame count: {count} Total frame count: {total}
th_th: จํานวนเฟรมที่ปิดเสียง: {count} จํานวนเฟรมทั้งหมด: {total}

source: Switching firmware to {target!r}
th_th: กําลังสลับเปลี่ยนเฟิร์มแวร์เป็น {target!r}

source: Discharging
th_th: การปล่อยประจุ

source: Charging
th_th: การชาร์จ

source: {action} to {target} (Current charge: {charge}, battery current: {battery_current} mA) under load {load}.
th_th: {action} ไปยัง {target} (ปัจจุบันชาร์จ: {charge}, กระแสไฟของแบตเตอรี่: {battery_current} mA) ที่ภาระ {load}

source: Time remaining: {timeout:.0f} sec.
th_th: เวลาที่เหลืออยู่: {timeout:.0f} วินาที

source: Testing discharge
th_th: กําลังทดสอบการปล่อยประจุ

source: Testing charger
th_th: กําลังทดสอบเครื่องชาร์จ

source: OK! Meet {target}
th_th: ตกลง! บรรลุ {target} แล้ว

source: Please connect to ethernet.
th_th: กรุณาเชื่อมต่อกับอีเธอร์เน็ต

source: {reason}. Press space to reinstall.
th_th: {reason} กดช่องว่างเพื่อติดตั้งใหม่

source: Flashing {component}...
th_th: กําลังเขียน {component}...

source: Updating {component}....
th_th: กําลังอัปเดต {component}...

source: Please remove USB type-C cable from port {port}
th_th: กรุณาถอดสาย USB ชนิด type-C ออกจากพอร์ต {port}

source: Checking Device State
th_th: กําลังตรวจสอบสถานะอุปกรณ์

source: north
th_th: เหนือ

source: south
th_th: ใต้

source: Put the DUT towards {direction}
th_th: วาง DUT ไปทาง {direction}

source: Remaining time:
th_th: เวลาที่เหลืออยู่:

source: Load:
th_th: ภาระ:

source: Please press POWER and (REFRESH*3) in {seconds} seconds.
th_th: กรุณากด POWER และ (REFRESH*3) ภายใน {seconds} วินาที

source: Display Test
th_th: การทดสอบจอแสดงผล

source: ({index}/{total}) Uploading images {name}
th_th: ( {index}/{total} ) กําลังอัพโหลดรูปภาพ {name}

source: All images uploaded.
th_th: อัพโหลดรูปภาพทั้งหมดเรียบร้อยแล้ว

source: Press space to show each image on display.
th_th: กดช่องว่างเพื่อแสดงแต่ละรูปภาพบนจอ

source: Press Enter to PASS after showing all images.
th_th: กด Enter เพื่อผ่าน หลังจากแสดงรูปภาพทั้งหมดแล้ว

source: Display Interactive Test;<br>After checking, test will automatically pass.
th_th: การทดสอบปฏิสัมพันธ์จอแสดงผล <br>หลังจากตรวจสอบแล้ว การทดสอบจะผ่านโดยอัตโนมัติ

source: Press Space to display;<br>After checking, Enter to pass; Esc to fail.
th_th: กด Space เพื่อแสดง <br> หลังจากตรวจสอบแล้ว ให้กดตัวเลขจํานวนจุดเพื่อผ่าน

source: Press Space to display;<br>After checking, Click the symptom if it is observed, Enter to pass.
th_th: กด Space เพื่อแสดง <br> หลังจากตรวจสอบแล้ว คลิกที่อาการหากสังเกตเห็น แล้วกด Enter เพื่อผ่าน

source: Untested
th_th: ยังไม่ได้ทดสอบ

source: Passed
th_th: ผ่านด่าน

source: Failed
th_th: ล้มเหลว

source: Please plug ethernet cable into built-in ethernet port<br>Press space to start.
th_th: กรุณาเสียบสายอีเธอร์เน็ตเข้าพอร์ตอีเธอร์เน็ตติดตั้งภายใน <br>กดช่องว่างเพื่อเริ่ม

source: Running shell commands...
th_th: กําลังเรียกใช้คําสั่งเชลล์...

source: {display_label} Audio
th_th: เสียง {display_label}

source: Connect external display and wait until it becomes primary.
th_th: เชื่อมต่อจอแสดงผลภายนอกและรอจนกว่าจอภายนอกจะกลายเป็นจอหลัก

source: Please connect to one external display only.
th_th: กรุณาเชื่อมต่อจอแสดงผลภายนอกเพียงจอเดียว

source: Do you see video on {display}?
th_th: คุณเห็นวิดีโอบน {display} ไหม

source: Press {key} to pass the test.
th_th: กด {key} เพื่อผ่านการทดสอบ

source: Fixture is checking if video is displayed on {display}?
th_th: อุปกรณ์ตรวจสอบว่ามีวิดีโอแสดงบน {display} ไหม

source: Connect external display: {display} and wait until it becomes primary.
th_th: เชื่อมต่อจอแสดงผลภายนอก: {display} และรอจนกว่าจอภายนอกจะกลายเป็นจอหลัก

source: Disconnect external display: {display}
th_th: ตัดการเชื่อมต่อจอแสดงผลภายนอก: {display}

source: Wrong USB side, please flip over {media}.
th_th: ข้างยูเอสบีผิด กรุณาพลิก {media} กลับด้าน

source: Wrong MUX information: {messages}.
th_th: ข้อมูล MUX ผิดพลาด: {messages}

source: Spin up fan
th_th: หมุนใบพัดพัดลม

source: Spin down fan
th_th: หยุดหมุนใบพัดพัดลม

source: Fan speed (RPM):
th_th: ความเร็วใบพัด (RPM):

source: Build Phase
th_th: ขั้นตอนการสร้าง

source: Write Protection
th_th: การป้องกันการเขียน

source: Factory Server
th_th: เซิร์ฟเวอร์โรงงาน

source: Enabled
th_th: เปิดใช้งาน

source: Disabled
th_th: ปิดใช้งาน

source: Running preflight tasks to prepare for finalization, please wait...
th_th: กําลังทํางานเตรียมการก่อนการสิ้นสุด กรุณารอสักครู่...

source: Finalizing, please wait.<br>Do not restart the device or terminate this test,<br>or the device may become unusable.
th_th: กําลังทําการสิ้นสุด กรุณารอสักครู่<br>อย่ารีสตาร์ทอุปกรณ์หรือยุติการทดสอบนี้<br>มิฉะนั้นอุปกรณ์อาจจะใช้การไม่ได้

source: Fingerprint Manual Test
th_th: การทดสอบลายนิ้วมือด้วยตนเอง

source: Touch fingerprint sensor
th_th: เซ็นเซอร์ลายนิ้วมือแบบสัมผัส

source: Fingerprint MQT Test
th_th: การทดสอบ MQT ลายนิ้วมือ

source: Please put device on a horizontal plane then press space to start testing.
th_th: กรุณาวางอุปกรณ์บนระนาบแนวนอนแล้วกดปุ่ม space เพื่อเริ่มการทดสอบ

source: Please do not move the device.
th_th: กรุณาอย่าเคลื่อนไหวอุปกรณ์

source: Please rotate the device.
th_th: กรุณาหมุนอุปกรณ์

source: Please put device on a static plane then press space to start calibration.
th_th: กรุณาวางอุปกรณ์บนพื้นผิวที่นิ่งแล้วกด space เพื่อเริ่มการปรับเทียบ

source: Calibration will be started within {secs} seconds.Please do not move the device.
th_th: การปรับเทียบจะเริ่มภายใน {secs} วินาที กรุณาอย่าเคลื่อนไหวอุปกรณ์

source: Collecting DUT materials...
th_th: กําลังเก็บรวบรวมวัสดุทดสอบ...

source: Generating HWID (v3)...
th_th: กําลังสร้าง HWID (v3)...

source: Verifying HWID (v3): {encoded_string}...
th_th: กําลังตรวจสอบ HWID (v3): {encoded_string}...

source: (unchanged)
th_th: (ไม่เปลี่ยนแปลง)

source: Setting HWID (v3): {encoded_string}...
th_th: กําลังตั้งค่า HWID (v3): {encoded_string}...

source: If the keyboard backlight lights up, press ENTER.
th_th: ถ้าไฟส่องกียบอร์ดติดขึ้นมา ให้กดปุ่ม ENTER

source: If the keyboard backlight is off, press ENTER.
th_th: ถ้าไฟส่องกียบอร์ดดับอยู่ ให้กดปุ่ม ENTER

source: Expected keycode sequence:
th_th: ลําดับรหัสปุ่มที่คาดว่าจะได้รับ:

source: Press keys sequentially from top-left to bottom-right.
th_th: กดปุ่มตามลําดับจากซ้ายบนไปขวาล่าง

source: Press main keyboards first before pressing the number pad keys.
th_th: กรุณากดปุ่มบนแป้นพิมพ์หลักก่อน จากนั้นจึงกดปุ่มบนหมายเลข

source: Press one key at a time.
th_th: กดปุ่มละปุ่มและกดครั้งละปุ่ม

source: yellow
th_th: เหลือง

source: green
th_th: เขียว

source: red
th_th: แดง

source: white
th_th: ขาว

source: blue
th_th: น้ําเงิน

source: amber
th_th: สีเหลืองอ่อน

source: off
th_th: ปิด

source: power LED
th_th: ไฟแสดงสถานะเปิด-ปิด

source: battery LED
th_th: ไฟแสดงสถานะแบตเตอรี่

source: adapter LED
th_th: ไฟแสดงสถานะอะแดปเตอร์

source: left LED
th_th: ซ้าย LED

source: right LED
th_th: ขวา LED

source: recovery hwreinit LED
th_th: การกู้คืน hwreinit LED

source: If the <strong>{name}</strong> is <strong>off</strong>, press ENTER.
th_th: ถ้า <strong>{name}</strong> ปิดอยู่ ให้กด ENTER

source: If the <strong>{name}</strong> lights up in <strong>{color}</strong>, press ENTER.
th_th: ถ้า <strong>{name}</strong> สว่างขึ้นมาเป็น <strong>{color}</strong> ให้กด ENTER

source: Test {test_id}
th_th: ทดสอบ {test_id}

source: Please press number key according to the <strong>{name}</strong> color
th_th: กรุณากดหมายเลขตามสีของ <strong>{name}</strong>

source: Result:
th_th: ผลลัพธ์:

source: Plug power into ports: {plug_ports}<br>Unplug power from ports: {unplug_ports}<br>Current power status: {status}
th_th: เสียบปลั๊กไฟเข้าพอร์ต: {plug_ports}<br>ถอดปลั๊กไฟออกจากพอร์ต: {unplug_ports}<br>สถานะปัจจุบันของปลั๊กไฟ: {status}

source: Demagnetizing lid sensor
th_th: การถอดแม่เหล็กของเซ็นเซอร์ฝาปิด

source: Open the lid
th_th: เปิดฝาปิด

source: Magnetizing lid sensor
th_th: การใส่แม่เหล็กของเซ็นเซอร์ฝาปิด

source: Close then open the lid
th_th: ปิดแล้วเปิดฝาปิด

source: Cover light sensor with finger
th_th: ปิดเซ็นเซอร์แสงด้วยนิ้วมือ

source: Remove finger from light sensor
th_th: เปิดเซ็นเซอร์แสงออกจากนิ้วมือ

source: Shine light sensor with flashlight
th_th: ส่องไฟฉายใส่เซ็นเซอร์แสง

source: ALS Sensor Calibration
th_th: การปรับเทียบเซ็นเซอร์ ALS

source: Cleaning up calibration values
th_th: กําลังล้างค่าการปรับเทียบ

source: Sampling {name}
th_th: กําลังสุ่มตัวอย่าง {name}

source: Checking ALS ordering
th_th: กําลังตรวจสอบลําดับ ALS

source: Calculating calibration coefficients
th_th: กําลังคํานวณค่าสัมประสิทธิ์การปรับเทียบ

source: Saving calibration coefficients to VPD
th_th: กําลังบันทึกค่าสัมประสิทธิ์การปรับเทียบไปยัง VPD

source: Validating ALS
th_th: การตรวจสอบความถูกต้องของ ALS

source: Fixture Connected
th_th: อุปกรณ์ต่อเชื่อมแล้ว

source: Fixture Disconnected
th_th: อุปกรณ์ถูกถอดจากการเชื่อมต่อแล้ว

source: Switching to lighting {name}
th_th: กําลังสลับไปยังแสงสว่าง {name}

source: Use indicated light source to pass each subtest.
th_th: ใช้แหล่งกําเนิดแสงที่ระบุไว้เพื่อผ่านแต่ละการทดสอบย่อย

source: Hit "space" to begin...
th_th: กด "space" เพื่อเริ่ม...

source: dark
th_th: มืด

source: Is the lightbar {color}?<br>Press SPACE if yes, "F" if no.
th_th: แถวไฟ {color} ใช่ไหม?<br>กด SPACE ถ้าใช่, "F" ถ้าไม่ใช่

source: Checking memory info...
th_th: กําลังตรวจสอบข้อมูลหน่วยความจํา...

source: <div>Press <strong>Enter</strong> to continue, or <strong>ESC</strong> if things are not going right.</div>
th_th: <div>กด <strong>Enter</strong> เพื่อดําเนินการต่อ, หรือ กด <strong>ESC</strong>ถ้าสิ่งต่างๆไม่เป็นไปอย่างถูกต้อง</div>

source: <div>Press <strong>Enter</strong> to continue.</div>
th_th: <div>กด <strong>Enter</strong> เพื่อดําเนินการต่อ</div>

source: Please confirm following values
th_th: โปรดยืนยันค่าต่อไปนี้

source: Interface {interface} not found
th_th: ไม่พบอินเทอร์เฟซ {interface}

source: Interface {interface} not initialized
th_th: อินเทอร์เฟซ {interface} ไม่ได้ถูกเริ่มต้น

source: Unknown Error on {interface}
th_th: เกิดข้อผิดพลาดที่ไม่รู้จักบน {interface}

source: Setting up interface {interface}
th_th: กําลังตั้งค่าอินเทอร์เฟซ {interface}

source: Press space to continue
th_th: กดปุ่ม space เพื่อดําเนินการต่อ

source: Please remove USB type-C cable in {secs:.1f} seconds
th_th: โปรดถอดสายเคเบิล USB type-C ภายใน {secs:.1f} วินาที

source: USB type-C port is disconnected in {secs:.1f} seconds
th_th: พอร์ต USB type-C ถูกถอดการเชื่อมต่อแล้วเมื่อ {secs:.1f} วินาทีที่ผ่านมา

source: Please attach USB type-C cable in {secs:.1f} seconds
th_th: โปรดเสียบสายเคเบิล USB type-C ภายใน {secs:.1f} วินาที

source: Wait DUT to reconnect
th_th: รอให้ DUT เชื่อมต่อใหม่

source: Flip USB type-C cable and plug in again...
th_th: พลิกสายเคเบิล USB type-C แล้วเสียบเข้าไปอีกครั้ง...

source: And press Enter key to continue...
th_th: แล้วกดปุ่ม Enter เพื่อดําเนินการต่อ...

source: Waiting for ADB device connection...
th_th: กําลังรอการเชื่อมต่ออุปกรณ์ ADB...

source: Checking Plankton INA current for protection...
th_th: กําลังตรวจสอบกระแส Plankton INA เพื่อการป้องกัน...

source: Testing battery {voltage}V charging...
th_th: กําลังทดสอบการชาร์จแบตเตอรี่ {voltage}V...

source: Testing battery discharging...
th_th: กําลังทดสอบการถ่ายเทประจุแบตเตอรี่...

source: Connecting BFT display: {device}
th_th: กําลังเชื่อมต่อจอแสดงผล BFT: {device}

source: Disconnecting BFT display: {device}
th_th: กําลังถอดการเชื่อมต่อจอแสดงผล BFT: {device}

source: BFT display {device} is connected. Sending image...
th_th: จอแสดงผล BFT {device} เชื่อมต่อแล้ว กําลังส่งภาพ...

source: Caution: monitor may turn black for a short time.
th_th: ระวัง: จอแสดงผลอาจมืดลงเป็นเวลาสั้นๆ

source: Running diagnostics privacy screen routine...
th_th: กําลังเรียกใช้การทดสอบระบบป้องกันความเป็นส่วนตัว...

source: Diagnostics privacy screen routine failed. Expected state: {expected_state}, current state: {current_state}
th_th: การทดสอบระบบป้องกันความเป็นส่วนตัวล้มเหลว สถานะที่คาดหวัง: {expected_state},สถานะปัจจุบัน: {current_state}

source: Privacy screen state "{state}" verified.
th_th: ตรวจสอบสถานะจอป้องกันความเป็นส่วนตัว "{state}" แล้ว

source: Please insert the SIM card
th_th: กรุณาใส่ซิมการ์ด

source: Detected! Please remove the SIM card
th_th: ตรวจพบแล้ว! กรุณาถอดซิมการ์ดออก

source: Checking SIM card is present or not...
th_th: กําลังตรวจสอบว่ามีซิมการ์ดอยู่หรือไม่...

source: Please insert the SIM card tray
th_th: กรุณาใส่ถาดซิมการ์ด

source: Detected! Please remove the SIM card tray
th_th: ตรวจพบแล้ว! กรุณาถอดถาดซิมการ์ดออก

source: Please cover the sensor by hand
th_th: กรุณาปิดเซนเซอร์ด้วยมือ

source: Please un-cover the sensor
th_th: กรุณาเปิดตัวรับสัญญาณ

source: Setting the sensor
th_th: ตั้งค่าตัวรับสัญญาณ

source: Reading device data from {vpd_section} VPD...
th_th: อ่านข้อมูลอุปกรณ์จาก {vpd_section} VPD...

source: Testing {device}...
th_th: กําลังทดสอบ {device}...

source: Performing r/w test on {count} {bsize}-byte random blocks...
th_th: กําลังทดสอบการอ่าน/เขียนบนบล็อกขนาด {bsize} ไบต์ จํานวน {count} บล็อกแบบสุ่ม...

source: Performing sequential r/w test of {bsize} bytes...
th_th: กําลังทดสอบการอ่าน/เขียนแบบต่อเนื่องขนาด {bsize} ไบต์...

source: Insert {media} drive for read/write test... {extra}<br>WARNING: DATA ON INSERTED MEDIA WILL BE LOST!
th_th: ใส่สื่อ {media} เพื่อทดสอบการอ่าน/เขียน... {extra}<br>คําเตือน: ข้อมูลบนสื่อที่ใส่จะสูญหาย!

source: Remove {media} drive...
th_th: ถอดไดรฟ์ {media} ...

source: Toggle lock switch and insert {media} drive again...
th_th: สลับสวิตช์ล็อคแล้วใส่ {media} เข้าไปอีกครั้ง...

source: Remove {media} drive and toggle lock switch...
th_th: นํา {media} ออก แล้วสลับสวิตช์ล็อคอีกครั้ง...

source: Executing Graphyte
th_th: กําลังเรียกใช้ Graphyte

source: Initializing Robot...
th_th: กําลังเริ่มต้นหุ่นยนต์...

source: Please load DUT onto the robot, connect all cables, and press <b>SPACE</b> to continue.
th_th: กรุณาใส่ DUT ลงบนหุ่นยนต์ เชื่อมต่อสายเคเบิลทั้งหมด และกด <b>ปุ่มช่องว่าง</b> เพื่อดําเนินการต่อ

source: Prepare for movement.
th_th: เตรียมพร้อมสําหรับการเคลื่อนไหว

source: Moving to start position...
th_th: กําลังเคลื่อนที่ไปยังตําแหน่งเริ่มต้น...

source: Moving to LOAD / UNLOAD position...
th_th: กําลังเคลื่อนที่ไปยังตําแหน่งโหลด/ถอดโหลด...

source: Computing...
th_th: กําลังประมวลผล...

source: Pushing the result...
th_th: กําลังส่งผลลัพธ์...

source: The scanned value is empty.
th_th: ค่าที่สแกนได้เป็นค่าว่าง

source: The scanned value "{value}" does not match the expected format.
th_th: ค่าที่สแกนได้ "{value}" ไม่ตรงกับรูปแบบที่คาดหวัง

source: The scanned value "{value}" does not match the expected value <span class=test-engineering-mode-only>"{expected_value}"</span>.
th_th: ค่าที่สแกนได้ "{value}" ไม่ตรงกับค่าที่คาดหวัง <spanclass=test-engineering-mode-only>"{expected_value}"</span>.

source: Writing to VPD. Please wait...
th_th: กําลังเขียนลง VPD กรุณารอสักครู่...

source: Scan {label}
th_th: สแกน {label}

source: Please scan the {label} and press ENTER.
th_th: กรุณาสแกน {label} แล้วกดเอนเตอร์

source: Retry
th_th: ลองใหม่

source: Invoking shopfloor service
th_th: กําลังเรียกใช้บริการ shopfloor

source: Shopfloor exception:
th_th: ข้อผิดพลาดจาก shopfloor:

source: reboot
th_th: รีบูต

source: full reboot
th_th: รีบูตเต็มรูปแบบ

source: halt
th_th: หยุด

source: direct ec reboot
th_th: รีบูต ec โดยตรง

source: Shutdown Test ({operation})
th_th: การทดสอบปิดเครื่อง ({operation})

source: Warming up the system for {delay} seconds.
th_th: กำลังอุ่นเครื่องระบบเป็นเวลา {delay} วินาที

source: Remote DUT is performing {operation}, timeout in {delay} seconds.
th_th: DUT ระยะไกลกำลังดำเนินการ {operation}, หมดเวลาใน {delay} วินาที

source: Verifying system state after {operation}
th_th: กำลังตรวจสอบสถานะระบบหลังจาก {operation}

source: System is going to {operation} in {delay} seconds.
th_th: ระบบกำลังจะดำเนินการ {operation} ใน {delay} วินาที

source: Accelerometer
th_th: เครื่องวัดความเร่ง

source: Calibrating {sensor_name}...
th_th: กำลังปรับเทียบ {sensor_name}...

source: Device not in position
th_th: อุปกรณ์ไม่อยู่ในตำแหน่ง

source: Please put the device in face-up position (press Enter to continue)
th_th: กรุณาวางอุปกรณ์ในตำแหน่งคว่ำหน้า (กด Enter เพื่อดำเนินการต่อ)

source: Waiting for device...
th_th: กำลังรออุปกรณ์...

source: Writing calibration data...
th_th: กําลังเขียนข้อมูลการสอบเทียบ...

source: Hit SPACE to start testing...
th_th: กดปุ่มช่องว่างเพื่อเริ่มทดสอบ...

source: Hit {name} to start testing...
th_th: กด {name} เพื่อเริ่มทดสอบ...

source: Plug in external power to continue.
th_th: กรุณาเสียบปลั๊กไฟภายนอกเพื่อดําเนินการต่อ

source: Factory install process did not complete. Auto-testing stopped.<br><br>Please install the factory test image using factory server<br>rather than booting from a USB drive.<br>
th_th: กระบวนการติดตั้งโรงงานไม่เสร็จสมบูรณ์ การทดสอบอัตโนมัติถูกหยุด<br><br>โปรดติดตั้งอิมเมจการทดสอบจากโรงงานโดยใช้เซิร์ฟเวอร์โรงงานแทน<br>แทนที่จะบูตจากไดรฟ์ USB<br>

source: Initialize some shared data...
th_th: กำลังเริ่มต้นข้อมูลที่ใช้ร่วมกัน...

source: Start Station Test
th_th: เริ่มการทดสอบสถานี

source: End Station Test
th_th: สิ้นสุดการทดสอบสถานี

source: Please attach DUT.
th_th: กรุณาต่อ DUT

source: Press SPACE to start the test.
th_th: กด SPACE เพื่อเริ่มการทดสอบ

source: Sending test results to shopfloor...
th_th: กำลังส่งผลการทดสอบไปยัง shopfloor...

source: Please remove DUT.
th_th: กรุณาถอด DUT

source: Press SPACE to end the test.
th_th: กด SPACE เพื่อสิ้นสุดการทดสอบ

source: Please extend the green line with stylus to the other end.<br>Stay between the two red lines.<br>Press SPACE to start; Esc to fail.
th_th: กรุณาใช้ปากกาสไตลัสลากเส้นสีเขียวไปยังอีกด้านหนึ่ง<br>กรุณาอยู่ระหว่างเส้นสีแดงทั้งสองเส้น<br>กด SPACE เพื่อเริ่ม; Esc เพื่อยกเลิก

source: Remove stylus
th_th: ถอดปากกาสไตลัส

source: Insert stylus
th_th: ใส่ปากกาสไตลัส

source: Insert or Remove stylus
th_th: ใส่หรือถอดปากกาสไตลัส

source: Click or press SPACE to continue
th_th: คลิกหรือกด SPACE เพื่อดำเนินการต่อ

source: Unable to proceed, since some previous tests have not passed.
th_th: ไม่สามารถดำเนินการต่อได้เนื่องจากบางการทดสอบก่อนหน้านี้ไม่ผ่าน

source: Click or press any key to continue...
th_th: คลิกหรือกดปุ่มใดก็ได้เพื่อดำเนินการต่อ...

source: passed
th_th: ผ่าน

source: failed
th_th: ไม่ผ่าน

source: active
th_th: ใช้งานอยู่

source: untested
th_th: ยังไม่ได้ทดสอบ

source: Test Status for {testName}:
th_th: สถานะการทดสอบสำหรับ {testName}:

source: Suspend/Resume: {run} of {cycle}
th_th: ระงับ/ดำเนินการต่อ: {run} ของ {cycle}

source: Change URL
th_th: เปลี่ยน URL

source: Please wait few seconds to edit...
th_th: กรุณารอสักครู่เพื่อแก้ไข...

source: No factor server URL configured.
th_th: ไม่มีการกําหนด URL ของเซิร์ฟเวอร์แฟคเตอร์

source: For debugging or development, enter engineering mode to start individual tests.
th_th: สําหรับการแก้ไขจุดบกพร่องหรือการพัฒนา ให้เข้าสู่โหมดวิศวกรรมเพื่อเริ่มต้นการทดสอบแบบเฉพาะเจาะจง

source: Change server URL:
th_th: เปลี่ยน URL ของเซิร์ฟเวอร์:

source: Set
th_th: ตั้งค่า

source: Please connect to network...
th_th: โปรดเชื่อมต่อกับเครือข่าย...

source: Expected network: {networks}
th_th: เครือข่ายที่คาดหวัง: {networks}

source: Current networks: {networks}
th_th: เครือข่ายปัจจุบัน: {networks}

source: Trying to reach server...
th_th: กําลังพยายามเชื่อมต่อกับเซิร์ฟเวอร์...

source: Trying to check server protocol...
th_th: กําลังพยายามตรวจสอบโพรโทคอลของเซิร์ฟเวอร์...

source: Server URL: {server_url}
th_th: URL ของเซิร์ฟเวอร์: {server_url}

source: Flush Test Log: Progress = <br>{progress}
th_th: เคลียร์บันทึกการทดสอบ: ความคืบหน้า = <br>{progress}

source: Collecting report data...
th_th: กําลังเก็บรวบรวมข้อมูลรายงาน...

source: Getting serial number...
th_th: กําลังรับเลขซีเรียล...

source: A software update is available. Press SPACE to update.
th_th: มีการอัปเดตซอฟต์แวร์ใหม่ให้ใช้ กดปุ่ม SPACE เพื่ออัปเดต

source: Preparing...
th_th: กําลังเตรียม...

source: Detect Server URL
th_th: ตรวจพบ URL ของเซิร์ฟเวอร์

source: Sync time
th_th: ซิงค์เวลา

source: Flush Event Logs
th_th: ล้างบันทึกเหตุการณ์

source: Flush Test Log
th_th: ล้างบันทึกการทดสอบ

source: Create Report
th_th: สร้างรายงาน

source: Upload report
th_th: อัพโหลดรายงาน
